package com.android.homework.bean;

/**
 * @auther 19062
 * @date 2023/9/22
 * @time 11:50.
 */


public  class WzString {
    public String getString(){
        String str ="驻车再生过程和注意事项 驻车再生过程和注意事项 过程和注意事项:\n" +
                "(1)DPF灯常亮，提示驾驶员需停车进行驻车再生；在确保行车安全的前提下，驾驶员应尽快将车辆停在周围无安全隐患的空旷场所，按照要求完成DPF再生工作。\n" +
                "警示1:\n" +
                "如驾驶员在有限时间内不主动进行驻车再生操作 ：如驾驶员在有限时间内不主动进行驻车再生操作 如驾驶员在有限时间内不主动进行驻车再生操作，则车辆会触发限扭功能 则车辆会触发限扭功能 则车辆会触发限扭功能，此过程发动机及后处理系统有损坏风险！ 动机及后处理系统有损坏风险！\n" +
                "警示2:\n" +
                "再生温度高，需注意排气系统附近或车辆附近无可燃物 需注意排气系统附近或车辆附近无可燃物 需注意排气系统附近或车辆附近无可燃物，勿在加油站及多粉尘场所等 勿在加油站及多粉尘场所等易燃易爆区域触发驻车再生； 易燃易爆区域触发驻车再生；\n" +
                " (2)确保车辆状态满足以下要求：\n" +
                "①车速为 0（根据配套协议选择）\n" +
                "②油门踏板没有踩下\n" +
                "③档位处于空档状态（根据配套协议选择）\n" +
                "④整车手刹（驻车开关）信号吸合（根据配套协议选择）\n" +
                "⑤启动发动机，维持怠速\n" +
                "⑥水温达到45℃以上\n" +
                "⑦再生禁止开关未按下\n" +
                "⑧无DPF及发动机相关故障；\n" +
                "注意：上述任一条件不满足 上述任一条件不满足 上述任一条件不满足，系统均无法进入再生过程 系统均无法进入再生过程 系统均无法进入再生过程\n"
                +" (3)按住再生开关按键超过3s，发动机自动进入再生状态，期间发动机转速会有阶段性的变化，再生大约持续在20分钟到40分钟，切勿人为干涉再生过程 切勿人为干涉再生过程 切勿人为干涉再生过程，防止对系统造成不利影响，再生过程中会轻微冒烟，此属正常现象；完成后转速恢复至怠速，DPF提醒灯自动熄灭，再生结束，驾驶员可正常操作车辆。\n" +
                "警示：再生过程中，驾驶员应就近监视车辆 驾驶员应就近监视车辆 驾驶员应就近监视车辆，并发动机舱周围放置警示标识 并发动机舱周围放置警示标识 并发动机舱周围放置警示标识，避免人员碰触导致烫伤。 碰触导致烫伤\n" +
                " (4)再生过程中，禁止触碰油门，刹车，驻车再生开关等，若发生危害车辆或人员安全的特殊情况，这时才可长按DPF再生开关或者再生禁止按钮（如有）超过3秒，即可退出驻车再生；";
        return str;
    }
}
